app/controllers/restaurants_controller.rb

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT 1  [["id", 1]]
---
	def show
		@restaurant = Restaurant.find_by_id(params[:id])